/*
===============================================================================
Проверка качества
===============================================================================
Назначение скрипта:
    Скрипт выполняет проверку качества для проверки целостности, согласованности
и точности золотого слоя. Проверки обеспечивают:
    - Уникальность суррогатных ключей в таблицах измерений.
    - Ссылочную целостность между таблицами фактов и таблицами измерений.
    - Проверку взаимосвязей в модели данных для аналитических целей.

===============================================================================
*/

-- ====================================================================
-- проверка 'gold.dim_customers'
-- ====================================================================
-- проверка на уникальность ключей in gold.dim_customers
-- Ожидаемый результат: нет ключей
SELECT 
    customer_key,
    COUNT(*) AS duplicate_count
FROM gold.dim_customers
GROUP BY customer_key
HAVING COUNT(*) > 1;

-- ====================================================================
-- проверка 'gold.product_key'
-- ====================================================================
-- Проверка на уникальность ключей gold.dim_products
-- Ожидаемый результат: нет ключей
SELECT 
    product_key,
    COUNT(*) AS duplicate_count
FROM gold.dim_products
GROUP BY product_key
HAVING COUNT(*) > 1;

-- ====================================================================
-- проверка 'gold.fact_sales'
-- ====================================================================
-- проверка на возможность соединения таблиц друг с другом
SELECT * 
FROM gold.fact_sales f
LEFT JOIN gold.dim_customers c
ON c.customer_key = f.customer_key
LEFT JOIN gold.dim_products p
ON p.product_key = f.product_key
WHERE p.product_key IS NULL OR c.customer_key IS NULL  
